fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.c
    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_1_MASK | GPIO_PUR_PU_6_MASK | GPIO_PUR_PU_15_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_1_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_6_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_15_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/TB1/CMPD_O/PWMA_2X, direction: OUTPUT, gpio_init_state: 'true', pull_select: down}
  - {pin_num: '45', peripheral: GPIOF, signal: 'GPIO, 11', pin_signal: GPIOF11/TXD0/XB_IN11, direction: OUTPUT, gpio_init_state: 'true', pull_select: down}
  - {pin_num: '56', peripheral: GPIOF, signal: 'GPIO, 10', pin_signal: GPIOF10/TXD2/PWMA_FAULT6/PWMB_FAULT6/XB_OUT10, direction: OUTPUT, gpio_init_state: 'true',
    pull_select: down}
  - {pin_num: '57', peripheral: GPIOF, signal: 'GPIO, 9', pin_signal: GPIOF9/RXD2/PWMA_FAULT7/PWMB_FAULT7/XB_OUT11, direction: OUTPUT, gpio_init_state: 'true', pull_select: down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF9 (pin 57) */
    GPIO_PinSetPeripheralMode(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF10 (pin 56) */
    GPIO_PinSetPeripheralMode(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF11 (pin 45) */
    GPIO_PinSetPeripheralMode(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinWrite(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF9 (pin 57)  */
    GPIO_PinWrite(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_GREEN_GPIO, BOARD_LED_GREEN_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF10 (pin 56)  */
    GPIO_PinWrite(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_BLUE_GPIO, BOARD_LED_BLUE_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF11 (pin 45)  */
    GPIO_PinWrite(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_YELLOW_GPIO, BOARD_LED_YELLOW_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUS = ((GPIOF->PUS &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUS_PUS_8_MASK | GPIO_PUS_PUS_9_MASK | GPIO_PUS_PUS_10_MASK | GPIO_PUS_PUS_11_MASK)))

                  /* Pull Resistor Type Select Bits: Pulldown resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_8_PULLDOWN)

                  /* Pull Resistor Type Select Bits: Pulldown resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_9_PULLDOWN)

                  /* Pull Resistor Type Select Bits: Pulldown resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_10_PULLDOWN)

                  /* Pull Resistor Type Select Bits: Pulldown resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_11_PULLDOWN));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOSCsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0, slew_rate: no_init, open_drain: no_init, pull_select: no_init, pull_enable: no_init}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL, slew_rate: no_init, open_drain: no_init, pull_select: no_init, pull_enable: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSCsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSCsPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTHERMISTORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '17', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7}
  - {pin_num: '19', peripheral: ADC, signal: 'ANA, 6', pin_signal: GPIOA6/ANA6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

