fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* Enable peripheral functionality on pin GPIOA6 (pin 19) */
    GPIO_PinSetPeripheralMode(BOARD_THER_A_GPIO, BOARD_THER_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 17) */
    GPIO_PinSetPeripheralMode(BOARD_THER_B_GPIO, BOARD_THER_B_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBOTGPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '90', peripheral: GPIOF, signal: 'GPIO, 13', pin_signal: GPIOF13/MOSI1/PWMB_FAULT1, direction: OUTPUT, gpio_init_state: 'false', open_drain: disable,
    pull_select: up}
  - {pin_num: '91', peripheral: GPIOF, signal: 'GPIO, 14', pin_signal: GPIOF14/SCLK1/PWMB_FAULT0, direction: OUTPUT}
  - {pin_num: '39', peripheral: USB, signal: DP, pin_signal: USB_DP}
  - {pin_num: '40', peripheral: USB, signal: DM, pin_signal: USB_DM}
  - {pin_num: '89', peripheral: GPIOF, signal: 'GPIO, 12', pin_signal: GPIOF12/MISO1/PWMB_FAULT2, direction: INPUT, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSBOTGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSBOTGPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF12 (pin 89) */
    GPIO_PinSetPeripheralMode(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF13 (pin 90) */
    GPIO_PinSetPeripheralMode(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF14 (pin 91) */
    GPIO_PinSetPeripheralMode(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF12 (pin 89)  */
    GPIO_PinSetDirection(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF12 (pin 89) */
    /* Pull mode configuration: Internal pull-up resistor is enabled */
    GPIO_PinSetPullResistorMode(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_PullUp);

    /* Pin configuration on GPIOF13 (pin 90) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_OutputPushPull);

    /* Initialize GPIO functionality on pin GPIOF13 (pin 90)  */
    GPIO_PinWrite(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF14 (pin 91)  */
    GPIO_PinWrite(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUS = ((GPIOF->PUS &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUS_PUS_13_MASK)))

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_13_PULLUP));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI_FLASHPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '48', peripheral: QSPI1, signal: MOSI, pin_signal: GPIOG11/TB3/CLKO0/MOSI1}
  - {pin_num: '47', peripheral: QSPI1, signal: MISO, pin_signal: GPIOD7/XB_OUT11/XB_IN7/MISO1}
  - {pin_num: '55', peripheral: QSPI1, signal: SCLK, pin_signal: GPIOF0/XB_IN6/TB2/SCLK1}
  - {pin_num: '95', peripheral: QSPI1, signal: SS, pin_signal: GPIOF7/TB3/CMPC_O/SS1_B/XB_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI_FLASHPins(void)
{
    /* GPIOD IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOD);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIOG IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOG);
    /* Enable peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MISO_GPIO, BOARD_SPI_FLASH_MISO_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_D7_MISO1);
    /* Enable peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SCLK_GPIO, BOARD_SPI_FLASH_SCLK_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F0_SCLK1);
    /* Enable peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SS_GPIO, BOARD_SPI_FLASH_SS_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F7_SS1_B);
    /* Enable peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MOSI_GPIO, BOARD_SPI_FLASH_MOSI_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_G11_MOSI1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM_LEDsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '68', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4, direction: OUTPUT}
  - {pin_num: '69', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5, direction: OUTPUT}
  - {pin_num: '74', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6, direction: OUTPUT}
  - {pin_num: '75', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7, direction: OUTPUT}
  - {pin_num: '82', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8, direction: OUTPUT}
  - {pin_num: '83', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

