fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM_LEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM_LEDsPins(void)
{
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* Enable peripheral functionality on pin GPIOE0 (pin 68) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED0_GPIO, BOARD_PWM_LED0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 68) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 69) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED1_GPIO, BOARD_PWM_LED1_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 69) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE2 (pin 74) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED2_GPIO, BOARD_PWM_LED2_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 74) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_PWMA_1B);
    /* Enable peripheral functionality on pin GPIOE3 (pin 75) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED3_GPIO, BOARD_PWM_LED3_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 75) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE4 (pin 82) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED4_GPIO, BOARD_PWM_LED4_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 82) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 83) */
    GPIO_PinSetPeripheralMode(BOARD_PWM_LED5_GPIO, BOARD_PWM_LED5_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 83) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCEL_MAGNET_I2CPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '60', peripheral: I2C1, signal: SCL, pin_signal: GPIOF2/SCL1/XB_OUT6/MISO1, open_drain: enable, pull_select: up, pull_enable: enable}
  - {pin_num: '61', peripheral: I2C1, signal: SDA, pin_signal: GPIOF3/SDA1/XB_OUT7/MOSI1, open_drain: enable, pull_select: up, pull_enable: enable}
  - {pin_num: '18', peripheral: GPIOA, signal: 'GPIO, 8', pin_signal: GPIOA8/CMPD_IN1, direction: INPUT, gpio_interrupt: gpioIrqRisingEdge, pull_enable: disable}
  - {pin_num: '14', peripheral: GPIOA, signal: 'GPIO, 9', pin_signal: GPIOA9/CMPD_IN2, direction: INPUT, gpio_interrupt: gpioIrqRisingEdge, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCEL_MAGNET_I2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCEL_MAGNET_I2CPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOA8 (pin 18) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_INT1_GPIO, BOARD_ACCEL_MAGNET_INT1_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOA9 (pin 14) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_INT2_GPIO, BOARD_ACCEL_MAGNET_INT2_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOF2 (pin 60) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF2 (pin 60) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F2_SCL1);
    /* Enable peripheral functionality on pin GPIOF3 (pin 61) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF3 (pin 61) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F3_SDA1);

    /* Initialize GPIO functionality on pin GPIOA8 (pin 18)  */
    GPIO_PinSetDirection(BOARD_ACCEL_MAGNET_INT1_GPIO, BOARD_ACCEL_MAGNET_INT1_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOA9 (pin 14)  */
    GPIO_PinSetDirection(BOARD_ACCEL_MAGNET_INT2_GPIO, BOARD_ACCEL_MAGNET_INT2_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 60) */
    /* Pull mode configuration: Internal pull-up resistor is enabled */
    GPIO_PinSetPullResistorMode(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_PullUp);
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 61) */
    /* Pull mode configuration: Internal pull-up resistor is enabled */
    GPIO_PinSetPullResistorMode(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_PullUp);
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Interrupt configuration on GPIOA8 (pin 18): Interrupt on rising edge */
    GPIO_PinSetInterruptConfig(BOARD_ACCEL_MAGNET_INT1_GPIO, BOARD_ACCEL_MAGNET_INT1_PIN_MASK, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIOA9 (pin 14): Interrupt on rising edge */
    GPIO_PinSetInterruptConfig(BOARD_ACCEL_MAGNET_INT2_GPIO, BOARD_ACCEL_MAGNET_INT2_PIN_MASK, kGPIO_InterruptRisingEdge);

    GPIOA->PUR = ((GPIOA->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_8_MASK | GPIO_PUR_PU_9_MASK)))

