fdmysterious/docker-cmake-dsc-codewarrior/app/board/pin_mux.c
                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_8_DISABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_9_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBtoSCIPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/TB0/XB_IN2/CLKO0}
  - {pin_num: '11', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSBtoSCIPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSBtoSCIPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_TXD0_GPIO, BOARD_Boot_TXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 11) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_RXD0_GPIO, BOARD_Boot_RXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 11) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '58', peripheral: CAN0, signal: TX, pin_signal: GPIOC11/CANTX/SCL1/TXD1, pull_enable: disable}
  - {pin_num: '59', peripheral: CAN0, signal: RX, pin_signal: GPIOC12/CANRX/SDA1/RXD1}
  - {pin_num: '13', peripheral: GPIOA, signal: 'GPIO, 10', pin_signal: GPIOA10/CMPD_IN3, direction: OUTPUT, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIO functionality on pin GPIOA10 (pin 13) */
    GPIO_PinSetPeripheralMode(BOARD_CAN_S_GPIO, BOARD_CAN_S_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOC11 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_CAN_TX_GPIO, BOARD_CAN_TX_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 58) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_CANTX);
    /* Enable peripheral functionality on pin GPIOC12 (pin 59) */
    GPIO_PinSetPeripheralMode(BOARD_CAN_RX_GPIO, BOARD_CAN_RX_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 59) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_CANRX);

    /* Initialize GPIO functionality on pin GPIOA10 (pin 13)  */
    GPIO_PinWrite(BOARD_CAN_S_GPIO, BOARD_CAN_S_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_CAN_S_GPIO, BOARD_CAN_S_PIN_MASK, kGPIO_DigitalOutput);

    GPIOA->PUR = ((GPIOA->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_10_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_10_DISABLED));

    GPIOC->PUR = ((GPIOC->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_11_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is disabled. */
                  | GPIO_PUR_PU(PUR_PU_11_DISABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitANA_SENSEPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '22', peripheral: ADC, signal: 'ANA, 0', pin_signal: GPIOA0/ANA0/CMPA_IN3/CMPC_O}
  - {pin_num: '23', peripheral: ADC, signal: 'ANA, 1', pin_signal: GPIOA1/ANA1/CMPA_IN0}
  - {pin_num: '33', peripheral: ADC, signal: 'ANB, 0', pin_signal: GPIOB0/ANB0/CMPB_IN3}
  - {pin_num: '42', peripheral: ADC, signal: 'ANB, 3', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0}
  - {pin_num: '36', peripheral: ADC, signal: 'ANB, 2', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3}
  - {pin_num: '24', peripheral: ADC, signal: 'ANA, 2', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitANA_SENSEPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitANA_SENSEPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* Enable peripheral functionality on pin GPIOA0 (pin 22) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_A_GPIO, BOARD_CUR_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 22) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA1 (pin 23) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_CA_GPIO, BOARD_CUR_CA_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA2 (pin 24) */
    GPIO_PinSetPeripheralMode(BOARD_VOLT_DCB_GPIO, BOARD_VOLT_DCB_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 33) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_B_GPIO, BOARD_CUR_B_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB2 (pin 36) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_DCB_GPIO, BOARD_CUR_DCB_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB3 (pin 42) */
    GPIO_PinSetPeripheralMode(BOARD_CUR_CB_GPIO, BOARD_CUR_CB_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC_CMPPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '26', peripheral: ADC, signal: 'ANB, 7', pin_signal: GPIOB7/ANB7/CMPB_IN2}
  - {pin_num: '28', peripheral: CMPB, signal: 'IN, 1', pin_signal: GPIOB6/ANB6/CMPB_IN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

